Repository: groehner/JavaEditor
Catalog: locale/*/LC_MESSAGES/default.po
Languages: de, pt_pt

source: Edit favorites
de: Favoriten bearbeiten
pt_pt: Editar Favoritos

source: Description
de: Beschreibung
pt_pt: Descrição

source: Line number
de: Zeilennummer
pt_pt: Numeração de linha

source: Go to line
de: &Gehe zur Zeile
pt_pt: &Ir à linha

source: JDK help
de: JDK-Hilfe
pt_pt: Ajuda do JDK

source: Favorites
de: Favoriten
pt_pt: &Favoritos

source: Search
de: Suchen
pt_pt: Procurar

source: Searchtext
de: Suchbegriff
pt_pt: Procurar texto

source: Documentation
de: Dokumentation
pt_pt: Documentação

source: Show
de: Zeigen
pt_pt: &Mostrar

source: Jar create
de: Jar create Dateien
pt_pt: Jar create arquivos

source: New entry
de: Neuer Eintrag
pt_pt: Novo item

source: Method call
de: Methodenaufruf
pt_pt: Chamada de método

source: Call of the method
de: Aufruf der Methode
pt_pt: Chamada do método

source: With current parameter values
de: Mit aktuellen Parameterwerten
pt_pt: Com valores de parâmetros atuais

source: Gives the result
de: Ergibt das Ergebnis
pt_pt: Dá o resultado

source: Detailed information (-v)
de: Ausführliche Informationen (-v)
pt_pt: Informação detalhada (-v)

source: Interruptable with ENTER+ESCAPE (-g)
de: Unterbrechbar mit EINGABE+ZURÜCK (-g)
pt_pt: Interromper com ENTER+ESCAPE (-g)

source: Run after upload (-r)
de: Nach dem Hochladen starten (-r)
pt_pt: Executar após transferir (-r)

source: Run
de: Starten
pt_pt: Executar

source: Console Viewer
pt_pt: Console

source: Terminate
de: Beenden
pt_pt: Terminar

source: Shutdown
de: Ausschalten
pt_pt: Encerramento

source: Upload
de: Hochladen
pt_pt: Carregar

source: Open folder
de: Ordner öffnen
pt_pt: Abrir pastas

source: Select filetype:
de: Dateityp wählen:
pt_pt: Tipo de arquivo:

source: With subfolders
de: Mit Unterverzeichnissen
pt_pt: Com subpastas

source: Start parameter
pt_pt: Parâmetro (inicial)

source: Call parameter
de: Aufrufparameter für
pt_pt: Parâmetros de chamada para

source: Start class
de: Start-Klasse
pt_pt: Classe (inicial)

source: Update
pt_pt: Atualizar

source: Current version
de: Aktuelle Version
pt_pt: Versão atual

source: Check automatically
de: Automatisch prüfen
pt_pt: Verificar

source: New version
de: Neue Version
pt_pt: Nova versão

source: Performs an update, requires administrator rights.
de: Führt ein Update durch. Benötigt dazu ausreichende Rechte.
pt_pt: Executa uma atualização, requer direitos de administrador.

source: Never
de: Nie
pt_pt: Nunca

source: Monthly
de: Monatlich
pt_pt: Mensal

source: Weekly
de: Wöchentlich
pt_pt: Semanalmente

source: Daily
de: Täglich
pt_pt: Diário

source: At every start
de: Bei jedem Start
pt_pt: A cada início

source: Design on/off
de: Design an/aus
pt_pt: Desígnio ligado/desligado

source: Design
pt_pt: Desígnio

source: Column
de: Spalte
pt_pt: Coluna

source: Explorer
pt_pt: Windows Explorer

source: Show in browser
de: Zeige im Browser
pt_pt: Visualizar o navegador

source: Open the associated design form
de: Zugehöriges Designformular öffnen
pt_pt: Abra o formulário de design associado

source: Edit class structure
de: Klassenstruktur bearbeiten
pt_pt: Editar estrutura da classe

source: Open class in UML window
de: Klasse im UML-Fenster öffnen
pt_pt: Abrir classe na janela UML

source: Go to the related bracket
de: Zur zugehörigen Klammer gehen
pt_pt: Ir ao fim de bloco associado

source: Structured indentation
de: Strukuriert einrücken
pt_pt: Endentar estrutura

source: if statement
de: If-Anweisung
pt_pt: declaração if

source: if-else statement
de: If-Else-Anweisung
pt_pt: declaração if-else

source: while statement
de: while-Anweisung
pt_pt: declaração while

source: for statement
de: for-Anweisung
pt_pt: declaração for

source: do-while statement
de: Do-while-Anweisung
pt_pt: declaração do-while

source: switch statement
de: Switch-Anweisung
pt_pt: instrução switch

source: try statement
de: try-Anweisung
pt_pt: declaração try

source: block statement
de: Block-Anweisung
pt_pt: declaração de bloco

source: Comment/Uncomment
de: Ein-/Auskommentieren
pt_pt: Comentário (on/off)

source: Indent
de: Einrücken
pt_pt: &Endentar+

source: Unindent
de: Ausrücken
pt_pt: &Endentar-

source: Word wrap
de: Zeilenumbruch
pt_pt: Envoltório de palavra

source: Clear breakpoints
de: Haltepunkte löschen
pt_pt: Limpar breakpoints

source: Set bookmark
de: Ein Lesezeichen setzen
pt_pt: Definir marca

source: Go to bookmark
de: Zum Lesezeichen gehen
pt_pt: Ir à marca

source: Paragraph on/off
de: Absatzmarken ein/aus
pt_pt: Parágrafo (on/off)

source: Line numbers on/off
de: Zeilennummern ein/aus
pt_pt: Numeração de linhas (on/off)

source: Zoom in
pt_pt: Ampliar

source: Zoom out
pt_pt: Reduzir

source: Validate
de: Validieren
pt_pt: Validar

source: Search declaration
de: Suche Deklaration
pt_pt: Declaração de pesquisa

source: API help
de: API-Hilfe
pt_pt: Ajuda da API

source: Open class
de: Klasse öffnen
pt_pt: Abrir classe

source: Class editor
de: Klasse bearbeiten
pt_pt: Editor de classe

source: Create structogram
de: Erzeuge Struktogramm
pt_pt: Criar diagrama estruturado

source: Execute
de: Ausführen
pt_pt: Executar

source: without console
de: ohne Konsole
pt_pt: sem console

source: with console
de: mit Konsole
pt_pt: com console

source: Add
pt_pt: Acrescentar

source: Commit
pt_pt: Efetivar revisão

source: Renew imports
de: Erneuere imports
pt_pt: Renovar importações

source: Copy path
de: Kopiere Pfadname
pt_pt: Copiar caminho

source: Undo
de: &Rückgängig
pt_pt: &Desfazer

source: Redo
de: &Widerrufen
pt_pt: &Refazer

source: Cut
de: &Ausschneiden
pt_pt: &Recortar

source: Copy
de: &Kopieren
pt_pt: &Copiar

source: Paste
de: &Einfügen
pt_pt: &Colar

source: Tree view on/off
pt_pt: Listar em árvore (on/off)

source: Level higher
pt_pt: Um nível acima

source: View menu
de: Ansicht-Menü
pt_pt: Menu de visualização

source: Set file filter
de: Dateifilter setzen
pt_pt: Definir filtro de arquivo

source: All (*.*)
de: Alle (*.*)
pt_pt: Todos (*.*)

source: Select favorite
de: Favorit wählen
pt_pt: Selecionar favorito

source: Large icons
de: Große Symbole
pt_pt: Ícones grandes

source: Small icons
de: Kleine Symbole
pt_pt: Ícones pequenos

source: List
pt_pt: Lista

source: Details
pt_pt: Detalhes

source: Structure
de: Struktur
pt_pt: Estrutura

source: Default layout
de: Standardlayout
pt_pt: Layout padrão

source: Revisions
de: Revisionen
pt_pt: Revisões

source: Revision
pt_pt: Revisão

source: Date
de: Datum
pt_pt: Data

source: Message
de: Beschreibung
pt_pt: Mensagem

source: GUI designer
pt_pt: FGUIDesigner

source: To source code
de: Zum Quelltext
pt_pt: Ir à fonte

source: In the foreground
de: In den Vordergrund
pt_pt: Para o primeiro plano

source: In the background
de: In den Hintergrund
pt_pt: Para o plano de fundo

source: Align
de: Ausrichten
pt_pt: Alinhar

source: Centered in the window
de: Zentriert im Fenster
pt_pt: Centro na janela

source: Equal distance
de: Gleicher Abstand
pt_pt: Igualmente espaço

source: Middle
de: Mitte
pt_pt: Meio

source: New class
de: Neue Klasse
pt_pt: Nova classe

source: New structogram
de: Neues Struktogramm
pt_pt: Novo diagrama estruturado

source: New sequence diagram
de: Neues Sequenzdiagramm
pt_pt: Novo diagrama de sequência

source: Panel - right-click for a subclass of Panel
de: Panel - Rechtsklick für eine Unterklasse von Panel
pt_pt: Panel - usar botão direito para subclasse

source: Canvas - right-click for a subclass of Canvas
de: Canvas - Rechtsklick für eine Unterklasse von Canvas
pt_pt: Canvas - usar botão direito subclasse

source: JPanel - right-click for a subclass of JPanel
de: JPanel - Rechtsklick für eine Unterklasse von JPanel
pt_pt: Panel - usar botão direito para subclasse

source: Canvas - right click for a sub class of Canvas
de: Canvas - Rechtsklick für eine Unterklasse von Canvas
pt_pt: Canvas - usar botão direito subclasse

source: Pagination
de: Paginierung
pt_pt: Paginação

source: Save all
de: Alle speichern
pt_pt: Salvar todos

source: left/right mouse button: font size bigger/smaller
pt_pt: botão esquerdo/direito do mouse: tamanho da fonte maior/menor

source: Object inspector on/off
de: Objekt-Inspektor ein/aus
pt_pt: Inspecionar objeto (on/off)

source: Diagram from open files
de: Diagramm aus Dateien
pt_pt: Diagrama(s) do(s) arquivo(s) aberto(s)

source: Messages on/off
de: Meldungen ein/aus
pt_pt: Mensagens (on/off)

source: Step
de: Einzelne Anweisung
pt_pt: Passo

source: Step over
de: Gesamte Routine
pt_pt: Ultrapassar

source: Compile
de: Compilieren
pt_pt: Compilar

source: Compile all
de: Alle compilieren
pt_pt: Compilar todos

source: North
pt_pt: Norte

source: South
pt_pt: Sul

source: West
pt_pt: Oeste

source: East
pt_pt: Leste

source: Center
pt_pt: Centro

source: &File
de: &Datei
pt_pt: &Arquivo

source: Structogram
de: Struktogramm
pt_pt: Diagrama estruturado

source: Sequence diagram
de: Sequenzdiagramm
pt_pt: Diagrama de sequência

source: Open...
de: Öffnen...
pt_pt: Abrir...

source: Reopen
de: Neu öffnen
pt_pt: Reabrir

source: Save as...
de: Speichern &unter...
pt_pt: Salvar &como...

source: Save all in...
de: Alle speichern in...
pt_pt: Salvar todos em...

source: Save as project
de: Als Projekt speichern
pt_pt: Salvar como projeto

source: Close project
de: Projekt schließen
pt_pt: Fechar projeto

source: Close all
de: &Alle schließen
pt_pt: Fechar todos

source: Export
de: Exportieren
pt_pt: Exportar

source: Print
de: &Drucken
pt_pt: &Imprimir#Ctrl+P

source: Print all
de: Alle drucken
pt_pt: Imprimir todos

source: Printer setup
de: Drucker&einrichtung
pt_pt: Configurar impressora

source: Exit
de: &Beenden
pt_pt: &Sair#Ctrl+Q

source: &Edit
de: B&earbeiten
pt_pt: Editar

source: RTF numbered
de: RTF nummeriert
pt_pt: RTF numerado

source: HTML as Text
de: HTML als &Text
pt_pt: HTML como &texto

source: Numbered
de: N&ummeriert
pt_pt: N&umeração

source: Replace
de: &Ersetzen
pt_pt: &Substituir

source: In files...
de: In Dateien suchen...
pt_pt: Procurar em arquivos...

source: Insert Unicode
de: Unicode einfügen
pt_pt: Inserir Unicode

source: &Start
pt_pt: &Executar

source: Upload Lejos firmware
de: Firmware Download
pt_pt: Baixar firmware

source: Program reset
de: Programm zurücksetzen
pt_pt: Reiniciar programa

source: Java reset
de: Java zurücksetzen
pt_pt: Redefinir Java

source: Parameter...
pt_pt: Parâmetro...

source: HTML for applet
de: HTML für Applet
pt_pt: HTML para Applet

source: HTML for java plugin
de: HTML für Java-PlugIn
pt_pt: HTML para Java-PlugIn

source: Jar file
de: Jar-Datei
pt_pt: Jar

source: Unpack
de: Entpacken
pt_pt: Desempacotar

source: &Test
pt_pt: &Testar

source: Next
de: Gesamte Routine
pt_pt: Próximo

source: Step up
de: Routine beenden
pt_pt: Avançar

source: Run to cursor
de: Bis zum Cursor ausführen
pt_pt: Executar até o cursor

source: Show execution line
de: Zeige Ausführungszeile
pt_pt: Mostrar ponto de execução

source: Delete breakpoints
de: Haltepunkte löschen
pt_pt: Limpar breakpoints

source: Watches
de: Überwachte Ausdrücke
pt_pt: Visualizações

source: Create sequence diagram
de: Erzeuge Sequenzdiagramm
pt_pt: Criar diagrama de sequência

source: Edit class
de: Klasse bearbeiten
pt_pt: Editar classe

source: New comment
de: Neuer Kommentar
pt_pt: Novo comentário

source: New layout
de: Neu layouten
pt_pt: Novo layout

source: Save as picture...
de: Als Bild speichern...
pt_pt: Salvar como imagem...

source: Compare text
de: Textvergleich
pt_pt: Comparar texto

source: Add file
de: Datei versionieren
pt_pt: Acrescentar arquivo

source: Log of file
de: Protokoll der Datei
pt_pt: Registro de arquivo

source: Compare files
de: Datei vergleichen
pt_pt: Comparar arquivo

source: Status of folder
de: Status des Ordners
pt_pt: Status de arquivo

source: Tree of repository
de: Baum des Repository
pt_pt: Listar repositório

source: Update from repository
de: Update vom Repository
pt_pt: Atualizar repositório

source: Add
pt_pt: Acrescentar

source: Execute all tests
de: Alle Tests ausführen
pt_pt: Execute todos os testes

source: Create test class
de: Erzeuge Testklasse
pt_pt: Criar classe de teste

source: &Components
de: &Komponenten
pt_pt: &Componentes

source: Data types
de: Datentyp
pt_pt: Tipos de dados

source: &Window
de: &Fenster
pt_pt: &Janela

source: Toolbar on/off
de: Symbolleiste ein/aus
pt_pt: Barra de ferramentas (on/off)

source: Messages docked/undocked
de: Meldungen angedockt/frei
pt_pt: Ancorar mensagens (on/off)

source: Structure on/off
de: Struktur ein/aus
pt_pt: Ligar/desligar estrutura

source: DOS window
de: DOS-Fenster
pt_pt: MS-DOS

source: Maximize
de: &Maximieren
pt_pt: &Maximizar

source: Cascade
de: Ü&berlappend
pt_pt: Cascatear

source: Tile vertically
de: &Nebeneinander
pt_pt: Dispor verticalmente

source: Tile horizontally
de: &Untereinander
pt_pt: Dispor horizontalmente

source: &Help
de: Hilfe
pt_pt: Ajuda

source: Index
pt_pt: Índice

source: Messages
de: Meldungen
pt_pt: Mensagens

source: Details on/off
de: Details ein/aus
pt_pt: Detalhes on/off

source: Call stack
de: Aufrufstack
pt_pt: Pilha de chamadas

source: Parameter and local variables
de: Parameter und lokale Variablen
pt_pt: Parâmetros e variáveis locais

source: Execute current line/selected
de: Markiertes/aktuelle Zeile ausführen
pt_pt: Executar linha atual

source: Show UML window
de: UML-Fenster zeigen
pt_pt: Mostrar janela UML

source: left: reset java/right: Java-Editor restart
de: links: Java zurücksetzen/rechts: Java-Editor neu starten
pt_pt: esquerda: redefinir java/direita: reinício do Java-Editor

source: Delete selected/all
de: Markiertes/Alles löschen
pt_pt: Remover selecionado/todos

source: &Interpreter
pt_pt: Interpretador

source: &Compiler
pt_pt: Compilador

source: &Debugger
pt_pt: Depurador

source: &Search
de: Suchen
pt_pt: Procurar

source: &Messages
de: Meldungen
pt_pt: Mensagens

source: Go to error
de: Gehe zum Fehler
pt_pt: Erro em desvio

source: Copy all
de: Alles kopieren
pt_pt: Copiar todos

source: Delete all
de: Alles löschen
pt_pt: Remover todos

source: Expand all
de: Alle ausklappen
pt_pt: Expandir todos

source: Collapse all
de: Alle einklappen
pt_pt: Colapsar todos

source: Dock
de: Andocken
pt_pt: Doca

source: Undock
de: Abdocken
pt_pt: Desencaixar

source: Object generator
de: Objekterzeuger
pt_pt: Criar objeto

source: Attribute
de: Attribut
pt_pt: Atributo

source: Object inspector
de: Objekt-Inspektor
pt_pt: Inspecionar objeto

source: Attributes
de: Attribute
pt_pt: Atributos

source: Events
de: Ereignisse
pt_pt: Eventos

source: More
de: &Mehr
pt_pt: &Mais

source: Go to source code
de: Zum Quellcode
pt_pt: Ir para o código-fonte

source: Backward
de: &rückwärts
pt_pt: Retornar

source: Font size
de: Schriftgröße
pt_pt: Tamanho da fonte

source: New watch
de: Neuer Ausdruck
pt_pt: Nova observação

source: Align to grid
pt_pt: Alinhar com a grade

source: Execute one test
de: Einen Test ausführen
pt_pt: Executar um teste

source: Edit interface
de: Interface bearbeiten
pt_pt: Editar interface

source: Open source code
de: Öffne Quellcode
pt_pt: Código fonte aberto

source: Connect with
de: Verbinde mit
pt_pt: Conectar a

source: Select connection type
de: Verbindungstyp wählen
pt_pt: Selecionar o tipo de conexão

source: Show inherited methods of system classes
de: Zeige geerbte Methoden von Systemklassen
pt_pt: Mostrar herdado métodos de classes do sistema

source: Hide inherited methods of system classes
de: Verberge geerbte Methoden von Systemklassen
pt_pt: Ocultar herdado métodos de classes do sistema

source: Icon
pt_pt: Ícone

source: Delete class/interface
de: Klasse/Interface löschen
pt_pt: Excluir classe/interface

source: Copy as picture
de: Als Bild kopieren
pt_pt: Copiar como imagem

source: Show object
de: Zeige Objekt
pt_pt: Mostrar objeto

source: Delete object
de: Lösche Objekt
pt_pt: Remover objeto

source: Inheritance
de: Vererbung
pt_pt: Herança

source: Recursive
de: Rekursiv
pt_pt: Recursivo

source: Top right
de: Rechts oben
pt_pt: Superior direita

source: Top left
de: Links oben
pt_pt: Superior esquerda

source: Bottom left
de: Links unten
pt_pt: Inferior esquerdo

source: Bottom right
de: Rechts unten
pt_pt: Inferior direito

source: Insert class
de: Klasse einfügen
pt_pt: Inserir classe

source: Open archiv
de: Öffne Archiv
pt_pt: Arquivo aberto

source: Selected class only
de: Nur ausgewählte Klasse
pt_pt: Apenas classe selecionada

source: Completely
de: Vollständig
pt_pt: Completamente

source: Connections: no, classes and objects, all
de: Verbindungen: keine, Klassen und Objekte, alle
pt_pt: Conexões: sem, classes e objetos, todos

source: Classes on/off
de: Klassen ein/aus
pt_pt: Clases on/off

source: Confirm replace
de: Ersetzen bestätigen
pt_pt: Confirmar a substituição

source: Replace all
de: &Alles ersetzen
pt_pt: &Substituir todos

source: Search for:
de: Suchen nach:
pt_pt: &Procurar por:

source: Replace with:
de: Ersetzen durch:
pt_pt: &Substituir por:

source: Regular expressions
de: &reguläre Ausdrücke
pt_pt: &Expressões regulares

source: Case sensitive
de: Groß-/&Kleinschreibung
pt_pt: &Ignorar tipo de letra

source: Whole words only
de: &nur ganze Wörter
pt_pt: &Palavras inteiras

source: Where
de: Bedingung
pt_pt: Onde

source: In directories
de: In &Verzeichnissen
pt_pt: Em &pastas

source: Current file
de: Aktuelle Datei
pt_pt: No arquivo at&ual

source: Search directory options
de: Suchverzeichnisoptionen
pt_pt: Opções do diretório de pesquisa

source: Directory
de: Verzeichnis
pt_pt: Pastas

source: Filemask
de: Dateimaske
pt_pt: Máscara

source: Search subfolders
de: &Unterverzeichnisse durchsuchen
pt_pt: &Procurar em subpastas

source: Select...
de: Auswählen...
pt_pt: Selecionar...

source: Direction
de: Richtung
pt_pt: Direção

source: From cursor
de: Ab &Cursor
pt_pt: A &partir do cursor

source: Selected text
de: Nur &markierter Text
pt_pt: Selecionar &texto

source: Abort search
de: Suche abbrechen
pt_pt: Abortar pesquisa

source: Border
de: Rahmen
pt_pt: Borda

source: Line
de: Zeile
pt_pt: Linha

source: Thickness
de: Dicke
pt_pt: Espessura

source: Rounded
de: Abgerundet
pt_pt: Arredondado

source: Highlight
de: Hervorheben
pt_pt: Destaque

source: Lowered
de: Gesenkt
pt_pt: Rebaixado

source: Border type
de: Rahmentyp
pt_pt: Tipo de borda

source: Icon editor
pt_pt: Editor de ícones

source: String list editor
de: Stringlisten-Editor
pt_pt: Editor de lista de cadeias de caracteres

source: Asynchron
pt_pt: Assíncrono

source: Return
pt_pt: Retornar

source: New lifeline
de: Neue Lebenslinie
pt_pt: Nova linha de vida

source: New actor
de: Neuer Akteur
pt_pt: Novo actor

source: Create lifeline
de: Neue Lebenslinie
pt_pt: Nova linha de vida

source: Delete lifeline
de: Lösche Lebenslinie
pt_pt: Excluir linha de vida

source: As text
de: Als Text
pt_pt: Como texto

source: Setup
de: Setup für JavaEditor
pt_pt: Configurar Java-Editor

source: Folder for storage of user specific settings with
de: Ordner zum Speichern von benutzerspezifischen Einstellungen mit
pt_pt: Pasta para armazenamento de configurações específicas do usuário com

source: permanent write rights. %Username% in path possible.
de: permanenten Schreibrechten. %Username% im Pfad möglich.
pt_pt: direitos de gravação permanentes. %Username% no caminho possível.

source: Installation folder - local or net
de: Installationsordner - lokal oder net
pt_pt: Pasta de instalação - local ou rede

source: Configuration settings
de: Konfigurationseinstellungen
pt_pt: Salvar preferências

source: save in Registry
de: In der Registrierung speichern
pt_pt: salvar no registro

source: save in INI files
de: Speichern in INI-Dateien
pt_pt: salvar em arquivos INI

source: Uninstall
de: Deinstallieren
pt_pt: Desinstalar

source: Create desktop symbol
de: Desktop-Symbol erzeugen
pt_pt: Criar atalho

source: Create entry in start menu
de: Eintrag in das Startmenü erzeugen
pt_pt: Criar entrada no menu Iniciar

source: Language
de: Sprache (Language)
pt_pt: Idioma

source: Portable application / USB flash drive
de: Portable Anwendung / USB-Stick
pt_pt: Aplicação portátil / USB flash drive

source: Java-Editor updater
pt_pt: Java-Editor atualizador

source: Retry
de: Wiederholen
pt_pt: Tentar novamente

source: Diagram
de: Diagramm
pt_pt: Diagrama

source: Trash bin
de: Papierkorb
pt_pt: Caixote do lixo

source: statement
de: Anweisung
pt_pt: declaração

source: subprogram
de: Unterprogramm
pt_pt: subprograma

source: Create java code
de: Erzeuge Java-Code
pt_pt: Criar código Java

source: Puzzle mode
de: Puzzlemodus
pt_pt: Modo de quebra-cabeça

source: Switch with case line
de: Switch mit case-Zeile
pt_pt: Alternar com a linha "case"

source: Add case
de: case hinzufügen
pt_pt: Adicionar case

source: Delete case
de: case löschen
pt_pt: Excluir case

source: Create method
de: Methode erstellen
pt_pt: Gerar methode

source: Create program
de: Programm erstellen
pt_pt: Gerar programa

source: Next difference
de: Nächster Unterschied
pt_pt: Próxima diferença

source: Prev difference
de: Vorheriger Unterschied
pt_pt: Diferença anterior

source: Compare
de: Textvergleich
pt_pt: Comparar

source: Differences only
de: Nur Unterschiede
pt_pt: Apenas diferenças

source: Copy block left
de: Kopiere Block nach links
pt_pt: Copiar bloco à esquerda

source: Copy block right
de: Kopiere Block nach rechts
pt_pt: Copiar bloco à direita

source: Ignore case
de: Ignoriere Groß-/Kleinschreibung
pt_pt: Ignorar maiúsculas e minúsculas

source: Ignore blanks
de: Ignoriere Leerzeichen
pt_pt: Ignorar espaços em branco

source: Paragraph marks on/off
de: Absatzmarken ein/aus
pt_pt: Marcas de parágrafo ligadas/desativadas

source: Information
de: Informationen
pt_pt: Informação

source: Overwrite
de: Überschreiben
pt_pt: Sobrescrever

source: Methods
de: Methoden
pt_pt: &Métodos

source: Delete method with sourcecode?
de: Methode samt Quellcode löschen?
pt_pt: Remover método com código fonte?

source: Open documentation
de: Öffne Dokumentation
pt_pt: Abrir documentação

source: Java interpreter %s not found!
de: Java-Interpreter %s nicht gefunden!
pt_pt: Interpretador Java %s não encontrado!

source: Edit JavaDoc User
de: JavaDoc-User bearbeiten
pt_pt: Editar JavaDoc User

source: other
de: sonst
pt_pt: outro

source: new
de: Neu
pt_pt: &Novo

source: close
de: &Schließen
pt_pt: fechar

source: ';' expected
de: es fehlt ein Semikolon
pt_pt: falta ponto-e-vírgula ';'

source: '(' expected
de: es fehlt eine Klammer auf '('
pt_pt: falta abrir parênteses '('

source: ')' expected
de: es fehlt eine Klammer zu ')'
pt_pt: falta fechar parênteses ')'

source: ']' expected
de: es fehlt eine eckige Klammer zu ']'
pt_pt: falta fechar parênteses ']'

source: '}' expected
de: es fehlt eine geschweifte Klammer zu '}'
pt_pt: falta chave '}'

source: > expected
de: es fehlt ein '>'
pt_pt: falta um '>'

source: <identifier> expected
de: einen Bezeichner angeben
pt_pt: especificar um identificador

source: not a statement
de: keine Anweisung
pt_pt: não é uma declaração

source: unclosed string literal
de: den String mit " schließen
pt_pt: fechar caracteres com "

source: illegal start of expression
de: ungültiger Beginn eines Ausdrucks
pt_pt: início de expressão inválido

source: illegal start of type
de: ungültiger Beginn eines Datentyps
pt_pt: início inválido de tipo de dados

source: cannot find symbol
de: kann Symbol nicht finden
pt_pt: não pode encontrar o símbolo

source: class, interface, or enum expected
de: Beginn einer Klasse erwartet
pt_pt: início de definição esperado

source: class expected
de: Klasse erwartet
pt_pt: início de definição esperado

source: reached end of file while parsing
de: es fehlt eine geschweifte Klammer zu '}'
pt_pt: falta '}'

source: might not have been initialized
de: ist nicht initialisiert
pt_pt: não foi inicializado

source: is already defined in
de: ist schon definiert in
pt_pt: já está definido em
