Repository: groehner/JavaEditor
Catalog: locale/*/LC_MESSAGES/default.po
Languages: de, pt_pt

source: Info
pt_pt: Informação

source: Used components
de: Verwendete Komponenten
pt_pt: Componentes usados

source: UML representation
de: UML-Darstellung
pt_pt: Apresentação UML

source: Exception handling
de: Ereignisbehandlung
pt_pt: Tratamento de exceções

source: Version and Author
de: Version und Autor
pt_pt: Versão e Autor

source: Connection types
de: Verbindungstyp
pt_pt: Tipo de conexão

source: Select
de: Wählen
pt_pt: Selecionar

source: Multiplicity A
de: Multiplizität A
pt_pt: Multiplicidade A

source: Relation
pt_pt: Relação

source: Multiplicity B
de: Multiplizität B
pt_pt: Multiplicidade B

source: Role A
de: Rolle A
pt_pt: Função A

source: Role B
de: Rolle B
pt_pt: Função B

source: Association undirected
de: Assoziation ungerichtet
pt_pt: Associação

source: Association directed
de: Assoziation gerichtet
pt_pt: Associação direcionada

source: Association bidirectional
de: Assoziation bidirektional
pt_pt: Associação bidirecional

source: Aggregation
pt_pt: Agregação

source: Aggregation with arrow
de: Aggregation gerichtet
pt_pt: Agregação com seta

source: Composition
de: Komposition
pt_pt: Composição

source: Composition with arrow
de: Komposition mit Pfeil
pt_pt: Composição com seta

source: Extends
de: Abgeleitet von
pt_pt: Estende

source: Implements
de: Implementiert
pt_pt: Implementos

source: Instance of
de: Exemplar von
pt_pt: Instancia de

source: Comment
de: Kommentar
pt_pt: Comentário

source: Turn
de: Umdrehen
pt_pt: Trocar

source: Delete
de: &Löschen
pt_pt: Remover

source: Cancel
de: &Abbrechen
pt_pt: &Cancelar

source: Recursive relation
de: Rekursive Beziehung
pt_pt: Relação recursiva

source: Upper left
de: Links oben
pt_pt: Superior esquerdo

source: Lower left
de: Links unten
pt_pt: Inferior esquerdo

source: Upper right
de: Rechts oben
pt_pt: Superior direito

source: Lower right
de: Rechts unten
pt_pt: Inferior direito

source: Go to
de: Gehe zu
pt_pt: Ir para

source: Close
de: Schließen
pt_pt: Fechar

source: Show source
de: Zeige Quelltext
pt_pt: Mostrar fonte

source: Back
de: Zurück
pt_pt: Retornar

source: Forward
de: &vorwärts
pt_pt: Avançar

source: Stop loading
de: Laden abbrechen
pt_pt: Parar

source: Refresh
de: Aktualisieren
pt_pt: Atualizar

source: Add to favorites
de: zu Favoriten hinzufügen
pt_pt: Para favoritos

source: Delete as favorite
de: Favorit löschen
pt_pt: Remover favoritos

source: UML class editor
de: UML-Klassen-Editor
pt_pt: Editor de UML classe

source: Class
de: Klasse
pt_pt: Classe

source: &Class
de: Klasse
pt_pt: classe

source: Name
pt_pt: Nome

source: &Attributes
de: Attribute
pt_pt: Atributos

source: Type
de: Typ
pt_pt: Tipo

source: Value
de: Wert
pt_pt: Valor

source: Visibility
de: Sichtbarkeit
pt_pt: Visibilidade

source: Options
de: Optionen
pt_pt: Opções

source: set method
de: set-Methode
pt_pt: método set()

source: get method
de: get-Methode
pt_pt: método get()

source: &Methods
de: &Methoden
pt_pt: &Métodos

source: Kind
de: Art
pt_pt: Tipo

source: Constructor
de: &Konstruktor
pt_pt: &Construtor

source: Procedure
de: &Prozedur
pt_pt: &Procedimento

source: Function
de: &Funktion
pt_pt: &Função

source: Formal parameters
de: Formale Parameter
pt_pt: Parâmetros formais

source: New
de: Neu
pt_pt: &Novo

source: Select attribute
de: Attribut wählen
pt_pt: Selecionar atributo

source: &New
de: Neu
pt_pt: &Novo

source: &Delete
de: &Löschen
pt_pt: Remover

source: &Close
de: &Schließen
pt_pt: Fechar

source: &Apply
de: &Übernehmen
pt_pt: &Aplique

source: Edit classpath
de: Classpath bearbeiten
pt_pt: Editar classpath

source: New jar file
de: Neue Jar-Datei
pt_pt: Novo arquivo Jar

source: New folder
de: Neuer Ordner
pt_pt: Nova pasta

source: Save
de: Speichern
pt_pt: Salvar

source: all jar files
de: Alle jar-Dateien
pt_pt: todos os arquivos jar

source: Configuration
de: Konfiguration
pt_pt: Configuração

source: Save the current settings
de: Speichert die aktuellen Einstellungen
pt_pt: Salvar preferências atuais

source: Outputs the entire configuration as a text file.
de: Gibt die gesamte Konfiguration als Textdatei aus.
pt_pt: Gera toda a configuração como um arquivo de texto.

source: Checks the paths and files
de: Prüft die eingestellten Pfade und Dateien
pt_pt: Verificar pastas e arquivos

source: Check
de: Prüfen
pt_pt: Verificar

source: Help
de: Hilfe
pt_pt: Ajuda

source: Title
de: Titel
pt_pt: Título

source: Parameter
pt_pt: Parâmetro

source: JavaFX folder
de: JavaFX-Ordner
pt_pt: Pasta do JavaFX

source: JavaFX parameter
pt_pt: JavaFX Parâmetro

source: JDK folder
de: JDK-Ordner
pt_pt: Pasta do JDK

source: User specific jar files can be specified here
de: Hier können benutzerspezifische Jar-Dateien angegeben werden
pt_pt: Arquivos jar específicos do usuário podem ser especificados aqui

source: Install
de: Installieren
pt_pt: Instalar

source: Edit
de: B&earbeiten
pt_pt: Editar

source: Folder with additional JavaDoc documentation
de: Ordner mit zusätzlichen JavaDoc-Dokumentationen
pt_pt: Pasta com documentações adicionais (JavaDoc)

source: Show interpreter call
de: Zeige Interpreteraufruf
pt_pt: Mostrar chamada do interpretador

source: Opens the last batch file for the interpreter call
de: Öffnet die letzte Batch-Datei für den Interpreter-Aufruf
pt_pt: Abrir o último arquivo batch para executar no interpretador

source: Java compiler
pt_pt: Compilador Java

source: Use Java compiler internally
de: Java-Compiler intern verwenden
pt_pt: Usar compilador Java internamente

source: Show compiler call
de: Zeige Compileraufruf
pt_pt: Mostrar chamada do compilador

source: Debugger
pt_pt: Depurador

source: Launching Applets
de: Starten von Applets
pt_pt: Executar Applets

source: Appletviewer for Java files and Browser for HTML files
de: Appletviewer für Java-Dateien und Browser für HTML-Dateien
pt_pt: Appletviewer para arquivos Java e navegador para arquivos HTML

source: Always Appletviewer
de: Immer Appletviewer
pt_pt: Sempre Appletviewer

source: Always Browser
de: Immer Browser
pt_pt: Sempre Navegador

source: Show HTML file for Applet
de: Zeige automatisch erzeugte HTML-Datei für ein Applet
pt_pt: Mostrar automaticamente arquivo HTML gerado para applet

source: Create
de: Erzeugen
pt_pt: Criar

source: Pack
de: Packen
pt_pt: Empacotar

source: All open files
de: Alle geöffneten Dateien
pt_pt: Em arquivos a&bertos

source: Indentation depth
de: Einrücktiefe
pt_pt: Endentação

source: Tab width
de: Tabulatorbreite
pt_pt: Tabulação

source: Intensity
de: Intensität
pt_pt: Intensidade

source: Show bracket pair
de: Klammerpaare zeigen
pt_pt: Mostrar símbolos pareados

source: Indentation help with tab
de: Einrückhilfe mit Tabulator
pt_pt: Endentar ajuda com tabulação

source: Automatic line indentation
de: Automatischer Zeileneinzug
pt_pt: Endentar linha automaticamente

source: Cursor may be to the right of the end of the line
de: Cursor darf rechts vom Zeilenende stehen
pt_pt: Permitir cursor à direita do fim de linha

source: Comment closing brackets
de: Kommentiere schließende Klammern
pt_pt: Comentar fins de blocos

source: Structured coloring
de: Programmstruktur färben
pt_pt: Colorir estrutura de programa

source: Insert control structures automatically
de: Kontrollstrukturen einfügen
pt_pt: Inserir estruturas de controle

source: Add missing semicolons
de: Fehlende Semikol ergänzen
pt_pt: Inserir ponto-e-vírgula faltante

source: Add bracket } automatically
de: Klammer } automatisch ergänzen
pt_pt: Completar blocos automaticamente

source: Number lines
de: Zeilen nummerieren
pt_pt: Numerar linhas

source: After { bracket indent
de: Nach { Klammer einrücken
pt_pt: Endentar depois de {

source: Flat
de: Flächig
pt_pt: Plano

source: Code folding for GUI elements
de: Code-Faltung für GUI-Komponenten
pt_pt: Código dobrável para componentes GUI

source: Show 80 characters line
de: 80 Zeichen Linie anzeigen
pt_pt: Mostrar linha de 80 caracteres

source: Code completion
de: Code-Vervollständigung
pt_pt: Completar código

source: Delay
de: Verzögerung
pt_pt: Atraso

source: For code completion and parameter hints
de: Für die Code-Vervollständigung und Parameter-Hinweise
pt_pt: Para se completar código e exibir dicas de parâmetros

source: the Java documentation must be installed.
de: muss die Java-Dokumentation installiert werden.
pt_pt: a documentação Java deverá ser instalada.

source: Height in lines
de: Höhe in Zeilen
pt_pt: Altura em linhas

source: min
pt_pt: mín

source: max
pt_pt: máx

source: Parameter hints
de: Parameter-Hinweise
pt_pt: Dicas de parâmetros

source: Font
de: &Schriftart
pt_pt: &Fonte

source: Show class Object
de: Klasse Object zeigen
pt_pt: Mostrar objeto de classe

source: Always
de: Immer
pt_pt: Sempre

source: With Ctrl+Space
de: Mit Strg+Leerzeichen
pt_pt: Con Ctrl+Space

source: Tool tips
pt_pt: Dicas

source: With F2 key
de: Mit Taste F2
pt_pt: Dica com tecla

source: Automatically after
de: Automatisch nach
pt_pt: Automaticamente

source: Text attributes
de: Textattribute
pt_pt: Atributo de texto

source: Colors
de: Farben
pt_pt: Cores

source: Element
pt_pt: Elemento

source: Background
de: Hintergrund
pt_pt: Fundo

source: Color of the current line
de: Farbe der aktuellen Zeile
pt_pt: Cor da linha ativa

source: Editor style
de: Editor-Stil
pt_pt: Estilo editor

source: Bold
de: Fe&tt
pt_pt: &Negrito

source: Italic
de: &Kursiv
pt_pt: &Itálico

source: Underline
de: &Unterstrichen
pt_pt: &Sublinha

source: Colors for
de: Farben für
pt_pt: Cores

source: Brackets
de: Klammern
pt_pt: Colchetes

source: No background color
de: Keine Hintergrundfarbe
pt_pt: Nenhuma cor de fundo

source: No color
de: Keine Farbe
pt_pt: Nenhuma cor

source: No syntax highlighting
de: Keine Syntaxhervorhebung
pt_pt: Sem realce de sintaxe

source: Author
de: Autor
pt_pt: Autor

source: Introductory comment for new programs
de: Einleitender Kommentar für neue Programme
pt_pt: Comentário de apresentação para programas novos

source: Introductory comment for methods
de: Einleitender Kommentar für Methoden
pt_pt: Comentário de apresentação para métodos

source: Short
de: Kurz
pt_pt: Curto

source: Free
de: Frei
pt_pt: Livre

source: Control structures
de: Kontrollstrukturen
pt_pt: Estruturas de controle

source: %NAME% as file name, %DATE% and %AUTHOR%
de: %NAME% als Dateiname, %DATE% und %AUTHOR%
pt_pt: %NAME% como nome de arquivo, %DATE% e %AUTHOR%

source: The following text variables can be used in the template files:
de: Folgende Textvariablen können in den Vorlagendateien benutzt werden:
pt_pt: É possível usar essas variáveis em modelos:

source: Hint
de: Hinweis
pt_pt: Dica

source: JUnit test
pt_pt: JUnit teste

source: From file
de: Aus Datei
pt_pt: Com origem em

source: Attention: predefined system key!
de: Achtung: vordefinierte Systemtaste!
pt_pt: Atenção: conflito com predefinição do sistema!

source: Keyboard shortcuts for source code
de: Tastenkürzel für Quelltext
pt_pt: Atalhos para código fonte

source: Open
de: Öffnen
pt_pt: Abrir

source: Keyboard shortcuts for
de: Tastenkürzel für
pt_pt: Atalhos para

source: All
de: Alle
pt_pt: Todos

source: Grid size in GUI designer
de: Rastergröße im GUI-Designer
pt_pt: Tamanho da grade no designer de GUI

source: Applet height
de: Applethöhe
pt_pt: Altura do applet

source: Applet width
de: Appletbreite
pt_pt: Largura do applet

source: Frame height
de: Framehöhe
pt_pt: Altura da janela

source: Frame width
de: Framebreite
pt_pt: Largura da janela

source: Name GUI components by attribute text
de: GUI-Komponenten nach Attribut Text benennen
pt_pt: Componentes GUI de nome após o atributo Text

source: Show hints in the GUI designer permanently
de: Hinweise im GUI-Designer dauerhaft anzeigen
pt_pt: Mostrar dicas permanentemente em GUI-Designer

source: Snap to grid
de: Am Raster ausrichten
pt_pt: Alinhar à grade

source: Input
de: Eingabe
pt_pt: Entrada

source: Output
de: Ausgabe
pt_pt: Saida

source: Algorithm
de: Algorithmus
pt_pt: Algoritmo

source: Yes
de: Ja
pt_pt: Sim

source: No
de: Nein
pt_pt: Não

source: Data type
de: Datentypen
pt_pt: Tipos de dados

source: Count of case
de: Anzahl der case
pt_pt: Número de opções

source: Else
de: Sonst
pt_pt: Outro

source: Shadow
de: Schatten
pt_pt: Sombra

source: Width
de: Breite
pt_pt: Largura

source: [i]=count variable, [1]=start value, [n]=end value, [s]=increment
de: [i]=Zählvariable, [1]=Startwert, [n]=Endwert, [s]=Schrittweite
pt_pt: [i]=contagem de variáveis, [1]=valor inicial, [n]=valor final, [s]=incremento

source: Input:
de: Eingabe:
pt_pt: Entrada:

source: Output:
de: Ausgabe:
pt_pt: Saida:

source: repeat while
de: wiederhole solange
pt_pt: repetir enquanto

source: repeat for [i] = [1] to [n]
de: wiederhole für [i] = [1] to [n]
pt_pt: repetir para [i] = [1] até [n]

source: yes
de: Ja
pt_pt: sim

source: no
de: Nein
pt_pt: não

source: Generate Java code
de: Generiere Javacode
pt_pt: Gerar código Java

source: As method
de: Als Methode
pt_pt: Como método

source: As program
de: Als Programm
pt_pt: Como programa

source: switch with case line
de: switch mit case-Zeile
pt_pt: switch-case (linha)

source: else
de: sonst
pt_pt: outro

source: Object
de: Objekt
pt_pt: Objeto

source: Filling
de: Füllung
pt_pt: Recheio

source: Show main call
de: Zeige main-Aufruf
pt_pt: Mostrar chamada main

source: Show parameter
de: Zeige Parameter
pt_pt: Mostrar parâmetro

source: Show return
de: Zeige Rückgabe
pt_pt: Mostrar retorno

source: "Open address" keys in browser
de: Tasten für "Adresse öffnen" im Browser
pt_pt: Teclas alternativas

source: External browser
de: Externer Browser
pt_pt: Navegador externo

source: Browser title
de: Browsertitel
pt_pt: Título

source: Use only one browser window
de: Nur ein Browser-Fenster benutzen
pt_pt: Usar apenas uma janela do navegador

source: Use Internet Explorer internally for documents
de: Für Dokumente Internet-Explorer intern benutzen
pt_pt: Usar Internet-Explorer internamente

source: IP address
de: IP-Adresse
pt_pt: Endereço-IP

source: Port
pt_pt: Porta

source: Use proxy
de: Proxy benutzen
pt_pt: Usar proxy

source: Files
de: Dateien
pt_pt: Arquivos

source: Search again
de: &Weitersuchen
pt_pt: &Procurar de novo

source: Java documentation folder - default %java%\docs
de: Ordner mit der Java-Dokumentation - standardmäßig %java%\docs
pt_pt: Pasta padrão para documentação - %java%\docs

source: Cache folder for documentation files when accessed via https:// addresses
de: Cache-Ordner für Dokumentationsdateien bei Zugriff über http://-Adressen
pt_pt: Cache-Pasta para arquivos de documentação via acesso http://

source: The tutorial file - %java%\tutorial\tutorial.chm
de: Die Tutorial-Datei - %java% utorial utorial.chm
pt_pt: O arquivo do tutorial - %java% utorial utorial.chm

source: Footer
de: Fußzeile
pt_pt: Rodapé

source: Header
de: Kopfzeile
pt_pt: Cabeçalho

source: Bottom
de: Unten
pt_pt: Fundo

source: Top
de: Oben
pt_pt: Topo

source: Right
de: Rechts
pt_pt: Direita

source: Left
de: Links
pt_pt: Esquerda

source: Border in mm
de: Ränder in mm
pt_pt: Borda em [mm]

source: Line numbers in border
de: Zeilennummern im Rand
pt_pt: Numeração na borda

source: With line numbers
de: Mit Zeilennummern
pt_pt: Com numeração

source: Alignment
de: Ausrichtung
pt_pt: Alinhamento

source: Centered
de: Zentriert
pt_pt: Central

source: Format: left#centered#right
de: Format: links#zentriert#rechts
pt_pt: Formato: esquerda#centro#direita

source: Print colored
de: Farbig drucken
pt_pt: Imprimir de cor

source: Template file
de: Vorlagendatei
pt_pt: Modelo

source: Lejos folder
de: Lejos-Ordner
pt_pt: Pasta Lejos

source: Version
pt_pt: Versão

source: Mindstorms mode
de: Mindstorms-Modus
pt_pt: Modo Mindstorms

source: realized by Felicia Ruppel
de: realisiert von Felicia Ruppel
pt_pt: realizado por Felicia Ruppel

source: on behalf of
de: im Auftrag von
pt_pt: em nome de

source: Roland Kluge and
de: Roland Kluge und
pt_pt: Roland Kluge e

source: Languages
de: Sprachen
pt_pt: Idiomas

source: Font size in component bar
de: Schriftgröße in Komponentenleiste
pt_pt: Tamanho da fonte na barra de componentes

source: Folder for temporary files
de: Ordner für temporäre Dateien
pt_pt: Pasta para arquivos temporários

source: Additional file filters
de: zusätzliche Dateifilter
pt_pt: Filtros de arquivos adicionais

source: Maximum number of files to reopen
de: Maximale Anzahl von Dateien zum Neu öffnen
pt_pt: Número máximo de arquivos para Reabrir

source: Log debugger
de: Debugger protokollieren
pt_pt: Registro do depurador

source: Save As renames class
de: Speichern unter benennt Klasse um
pt_pt: Renomear classe ao salvar

source: Use the interpreter window as a console for console programs
de: Bei Konsolenprogrammen das Interpreterfenster als Konsole benutzen
pt_pt: Para programas de console, use a janela do intérprete como um console

source: Create BAK files when saving
de: BAK-Dateien beim Speichern anlegen
pt_pt: Criar arquivos de backup (bak) quando salvar

source: Monitor external modification of files
de: Externe Änderung von Dateien überwachen
pt_pt: Verificar mudanças externas em arquivos

source: Strict Java in interactive windows
de: Striktes Java in Interaktiv-Fenstern
pt_pt: Usar apenas Java em janelas interativas

source: Accept the default name when saving
de: Akzeptiere Defaultnamen beim Speichern
pt_pt: Aceite o nome padrão durante a poupança

source: Reload the last opened windows on startup
de: Die zuletzt geöffneten Fenster beim Starten wieder laden
pt_pt: Recarregue as últimas janelas abertas na inicialização

source: Load files on startup
de: Dateien beim Starten laden
pt_pt: Carregar arquivos ao iniciar

source: Translate compiler errors
de: Übersetze Compilerfehler
pt_pt: Traduzir erros do compilador

source: New style
de: Neuer Stil
pt_pt: Novo estilo

source: Preview
de: Vorschau
pt_pt: Visualizar

source: Current style
de: Aktueller Stil
pt_pt: Estilo atual

source: Restrictions can only be changed with administrator rights.
de: Restriktionen können nur mit Administratorrechten geändert werden.
pt_pt: As restrições só podem ser alteradas com direitos de administrador.

source: Block internet access
de: Internetzugang sperren
pt_pt: Bloquear o acesso à Internet

source: Lock paths
de: Pfade sperren
pt_pt: Bloquear caminhos

source: Disable DOS window
de: DOS-Fenster deaktivieren
pt_pt: Desativar MS-DOS

source: Lock conversion structogram <-> program
de: Konvertierung Struktogramm <-> Programm sperren
pt_pt: Bloquear conversão estructograma <-> programa

source: Associate these file extensions with the Java-Editor
de: Verknüpfe diese Dateierweiterungen mit dem Java-Editor
pt_pt: Associar essas extensões de arquivos ao Java-Editor

source: Additional associations
de: Zusätzliche Verknüpfungen
pt_pt: Extensões de arquivos adicionais

source: Association of the Java-Editor
de: Verknüpfung des Java-Editor
pt_pt: Associar ao Java-Editor

source: Change
de: Ändern
pt_pt: Executar

source: Design of objects
de: Design der Objekte
pt_pt: Projeto de objeto

source: Design of classes
de: Design der Klassen
pt_pt: Projeto de classe

source: Valid class
de: Gültige Klasse
pt_pt: Classe válida

source: Invalid class
de: Ungültige Klasse
pt_pt: Classe inválida

source: Color
de: Farbe
pt_pt: Cor

source: Design of comments
de: Design der Kommentare
pt_pt: Projeto de comentários

source: Attributes and methods
de: Attribute und Methoden
pt_pt: Atributos e métodos

source: rectangular
de: rechteckig
pt_pt: retangular

source: rounded
de: rechteckig
pt_pt: retangular

source: Caption
de: Beschriftung
pt_pt: Título

source: Object: class
de: Objekt: Klasse
pt_pt: Objeto: Classe

source: View
de: Ansicht
pt_pt: Visão

source: none
de: keine
pt_pt: nenhum

source: all
de: alle
pt_pt: todos

source: Order
de: Reihenfolge
pt_pt: Ordem

source: Source code
pt_pt: Código fonte

source: Alphabetical
de: Alphabetisch
pt_pt: Alfabeticamente

source: : Type
de: : Typ
pt_pt: : Tipo

source: (...): Type
de: (...): Typ
pt_pt: (...): tipo

source: (Type, Type): Type
de: (Typ, Typ): Typ
pt_pt: (Tipo, Tipo): Tipo

source: (Name: Type): Type
de: (Name: Typ): Typ
pt_pt: (nome: tipo): tipo

source: Icons
pt_pt: Ícones

source: Class representation
de: Klassendarstellung
pt_pt: Apresentação de classe

source: Show empty attribute and method rectangles
de: Leere Attribute- und Methoden-Rechtecke zeigen
pt_pt: Mostrar retângulos para métodos e atributos vazios

source: Use return value "void".
de: Rückgabewert void benutzen.
pt_pt: Usar valor de retorno (void)

source: Integer instead of int
de: Integer statt int
pt_pt: Integer em vez de int

source: Start with the data type
de: Beginne mit dem Datentyp
pt_pt: Iniciar com o tipo de dado

source: Show class parameters separately
de: Klassenparameter separat anzeigen
pt_pt: Mostrar os parâmetros da classe separadamente

source: Role hides attribute
de: Rolle verbirgt Attribut
pt_pt: Atributo de ocultação de função

source: Show constructor with visibility
de: Konstruktor mit Sichtbarkeit zeigen
pt_pt: Mostrar construtores com visibilidade

source: Relationship attributes in bold
de: Beziehungsattribute fett
pt_pt: Atributos de relacionamento em negrito

source: Object representation
de: Objektdarstellung
pt_pt: Apresentação de objetos

source: Show with methods
de: Mit Methoden zeigen
pt_pt: Mostrar com métodos

source: Show with inherited private attributes
de: Mit geerbten privaten Attribute zeigen
pt_pt: Mostrar com atributos privados herdados

source: Show all new objects
de: Zeige alle neuen Objekte
pt_pt: Mostrar todos os novos objetos

source: Start names with a lower case letter
de: Namen mit Kleinbuchstaben beginnen
pt_pt: Iniciar nome por letras minúsculas

source: Without visibility
de: Ohne Sichtbarkeit
pt_pt: Sem visibilidade

source: ArrayList as integrated list
de: ArrayList als integrierte Liste
pt_pt: ArrayList como lista integrada

source: Class editing
de: Klassenbearbeitung
pt_pt: Edição de classe

source: Only open public classes
de: Nur public Klassen öffnen
pt_pt: Somente abrir classes públicas

source: Default modifiers for attributes and methods
de: Standardmodifier für Attribute und Methoden
pt_pt: Modificadores padrões para atributos e métodos

source: Setter without this
de: Setter ohne this
pt_pt: Setter sem this

source: Attributes start with a, parameters with p
de: Attribute beginnen mit a, Parameter mit p
pt_pt: Attributes starts with a, parameters with p

source: Object editing
de: Objectbearbeitung
pt_pt: Edição de objetos

source: Private attributes editable
de: Private Attribute editierbar
pt_pt: Atributos privados editáveis

source: Output function values in the interpreter window
de: Funktionswerte im Interpreterfenster ausgeben
pt_pt: Mostrar valores de funções no interpretador

source: Tabs
de: Registerkarten
pt_pt: Tabulações

source: Elements
de: Elemente
pt_pt: Itens

source: Toolbars
de: Symbolleisten
pt_pt: Barras de ferramentas

source: Log files
de: Protokolldateien
pt_pt: Registros

source: Exceptions
de: Ausnahmen
pt_pt: Exceções

source: Interactive
de: Interaktiv
pt_pt: Interativo

source: Git folder
de: Git-Ordner
pt_pt: Git pasta

source: JUnit jar file
de: JUnit-jar-Datei
pt_pt: Arquivo jar JUnit

source: Checkstyle jar file
de: Checkstyle-Jar-Datei
pt_pt: Arquivo Checkstyle

source: Repository
pt_pt: Repositório

source: SVN folder
pt_pt: Pasta SVN

source: Configure tools
de: Tools konfigurieren
pt_pt: Configurar ferramentas

source: Tools
pt_pt: Ferramentas

source: Program
de: Programm
pt_pt: Programa

source: Wait for execution
de: Ausführung abwarten
pt_pt: Aguardar a execução

source: File
de: &Datei
pt_pt: &Arquivo

source: Evaluate expression
de: Ausdruck auswerten
pt_pt: Avaliar expressão

source: Expression
de: Ausdruck
pt_pt: Expressão

source: Result
de: Ergebnis
pt_pt: Resultado

source: Evaluate
de: Auswerten
pt_pt: Avaliar

source: Watch
de: Überwachen
pt_pt: Observar
