Repository: groehner/JavaEditor
Catalog: locale/*/LC_MESSAGES/default.po
Languages: de, pt_pt

source: array required, but found
de: array erforderlich, aber %s gefunden
pt_pt: matriz necessária, mas %s encontrado

source: incompatible types
de: Datentypen passen nicht zueinander: %s kann nicht in %s konvertiert werden
pt_pt: tipos incompatíveis: %s não pode ser convertido em %s

source: incompatible types: missing return value
de: Der Wert für return fehlt
pt_pt: falta valor de retorno

source: incompatible types: unexpected return value
de: void Methoden können keinen Wert zurückgeben
pt_pt: valor de retorno inesperado

source: incompatible types: possible lossy
de: kann Datentyp nicht von% s nach% s konvertieren
pt_pt: tipos incompatíveis: possível perda

source: invalid method declaration; return type required
de: Rückgabetyp für die Methode fehlt
pt_pt: falta tipo de retorno

source: non-static cannot be referenced
de: Kann nicht statisch auf das nicht-statische %s verweisen
pt_pt: não estático não pode ser referenciado

source: unreachable statement
de: Unerreichbare Anweisung
pt_pt: instrução inacessível

source: bad operand types for binary operator
de: ungültige Datentypen für Operator
pt_pt: tipo inválido para o operador

source: NXT options
de: NXT Optionen
pt_pt: Opções NXT

source: In section [user] of the configuration file "%s" the value
de: In der Konfigurationsdatei %s ist im Abschnitt "User" der Wert
pt_pt: Na seção [do usuário] do arquivo de preferências %s o valor

source: of the key "HomeDir" for the home directory of the user is not set.
de: des Schlüssels "HomeDir" für das Home-Verzeichnis des Benutzers nicht gesetzt.
pt_pt: da chave "HomeDir" para a pasta padrão do usuário não está definida.

source: Could not create the preferencesfile %s!
de: Die Konfigurationsdatei %s konnte nicht erzeugt werden!
pt_pt: Impossível criar o arquivo de preferências %s!

source: Internet Explorer is not installed.
de: Der Internet-Explorer ist nicht installiert.
pt_pt: Internet Explorer não está instalado.

source: Jar create files
de: Jar create Dateien
pt_pt: Criar arquivo Jar

source: Could not create preferences.
de: Die Konfiguration konnte nicht erzeugt werden.
pt_pt: Impossível criar preferências.

source: from
de: vom
pt_pt: com origem em

source: Form
de: Formular
pt_pt: Modelo

source: All files
de: Alle Dateien
pt_pt: Todos os arquivos

source: Programs
de: Programme
pt_pt: Programas

source: Code
pt_pt: Código

source: Templates
de: Vorlagen
pt_pt: Modelos

source: Keyboard
de: Tastatur
pt_pt: Teclado

source: Structograms
de: Struktogramme
pt_pt: Estruturagramas

source: Sequencediagrams
de: Sequenzdiagramme
pt_pt: Diagramas de sequência

source: Printer
de: Drucker
pt_pt: Impressora

source: Styles
de: Stile
pt_pt: Estilos

source: Restrictions
de: Restriktionen
pt_pt: Restrições

source: Associations
de: Verknüpfungen
pt_pt: Associações

source: UML options
de: UML-Optionen
pt_pt: UML-Opções

source: Starting debugger, please wait...
de: Starte Debugger, bitte warten...
pt_pt: Iniciando o depurador, favor aguardar...

source: Debugger finished.
de: Debugger beendet.
pt_pt: Depurador terminado.

source: main() method missing!
de: main()-Methode fehlt!
pt_pt: main() inexistente!

source: Debugger started.
de: Debugger gestarted.
pt_pt: Depurador iniciado.

source: Breakpoint hit
de: Haltepunkt erreicht
pt_pt: Breakpoint

source: Use program to hit a breakpoint.
de: Verwende das Programm, um einen Haltepunkt zu erreichen.
pt_pt: Use o programa para atingir um ponto de interrupção.

source: Cancel search for "%s"
de: Suche nach "%s" abbrechen
pt_pt: Cancele a busca por "%s"

source: Error while unpacking
de: Fehler beim Entpacken
pt_pt: Erro ao desempacotar

source: The Java-Editor is up to date.
de: Der Java-Editor ist aktuell.
pt_pt: O Java-Editor está atualizado.

source: Font size is %3d pt. Print anyhow?
de: Die Schriftgröße beträgt %3d pt. Soll dennoch gedruckt werden?
pt_pt: Tamanho da fonte é %3d pt. Imprimir mesmo assim?

source: File from Java-Editor
de: Dokument vom Java-Editor
pt_pt: Imprimir documento

source: File %s externally modified. Open new?
de: Datei %s wurde extern geändert. Neu laden?
pt_pt: Arquivo %s modificado externamente. Abrir novo?

source: Invalid class name
de: Ungültiger Klassenname
pt_pt: Nome para a classe inválido

source: Start Applet
de: Applet starten
pt_pt: Iniciar Applet

source: Files in the cache folder are not compiled.
de: Dateien im Cache-Verzeichnis werden nicht compiliert.
pt_pt: Arquivos no cache de pasta-não são compilados.

source: disassembled
de: disassembliert
pt_pt: reconversão

source: Error during disassembling of %s
de: Fehler beim Disassemblieren von %s
pt_pt: Erro durante a reconversão de %s

source: Error during creation of documentation.
de: Fehler beim Erzeugen der Dokumentation.
pt_pt: Erro durante a criação de documento.

source: The JUnit manual is not installed.
de: Das JUnit-Handbuch ist nicht installiert.
pt_pt: O manual JUnit não está instalado.

source: Jar call
de: Jar-Aufruf
pt_pt: Chamar jar

source: Too much files to open.
de: Zuviele Dateien zum Öffnen.
pt_pt: Excesso de arquivos para abrir.

source: Overwrite with jar files?
de: Mit Jar-Dateien überschreiben?
pt_pt: Sobrescrever com arquivos jar?

source: Show content of jar file
de: Inhalt einer Jar-Datei anzeigen
pt_pt: Mostrar conteúdo de arquivo jar

source: Unpack jar file
de: Jar-Datei entpacken
pt_pt: Desempacotar arquivo jar

source: Open jar file
de: Jar-Datei öffnen
pt_pt: Abrir arquivo jar

source: No browser configured
de: Kein Browser konfiguriert
pt_pt: Nenhum navegador configurado

source: The tutorial %s is not installed.
de: Das Tutorial %s ist nicht installiert.
pt_pt: O tutorial não está instalado.

source: The Java book from www.javabuch.de is not installed.
de: Das Javabuch von www.javabuch.de ist nicht installiert.
pt_pt: O Javabook obtido de www.javabuch.de não está instalado.

source: The mindstorms manual from https://lejos.sourceforge.net/ is not installed.
de: Das Mindstorms-Manual von http://lejos.sourceforge.net/ ist nicht installiert.
pt_pt: O manual mindstorms do https://lejos.sourceforge.net/ não está instalado.

source: JavaFX needs Java JDK 8 or higher
de: JavaFX benötigt Java JDK 8 oder höher
pt_pt: JavaFX precisa de Java JDK 8 ou superior

source: Sourcecode has errors. Open anyway?
de: Quelltext enthält Fehler. Dennoch öffnen?
pt_pt: Sourcecode tem erros. Abra qualquer maneira?

source: Space
de: Leerraum
pt_pt: Espaço

source: PgUp
de: BildAuf
pt_pt: Página acima

source: PgDn
de: BildAb
pt_pt: Página abaixo

source: Up
de: Auf
pt_pt: Para cima

source: Down
de: Ab
pt_pt: Para baixo

source: Ins
de: Einf
pt_pt: Inserção

source: contains errors.
de: enthält Fehler.
pt_pt: contém erros.

source: Starting
de: Starten
pt_pt: Iniciando

source: Full
de: &Alles
pt_pt: &Completo

source: America
de: Amerika
pt_pt: América

source: Europe
de: Europa
pt_pt: Europa

source: Asia
de: Asien
pt_pt: Ásia

source: selected
de: ausgewählt
pt_pt: selecionado

source: Continent
de: Kontinent
pt_pt: Continente

source: Parameter for constructor
de: Parameter für Konstruktor
pt_pt: Parâmetro para o construtor

source: Parameter for method call
de: Parameter für Aufruf der Methode
pt_pt: Parâmetro para chamada de método

source: Edit object
de: Bearbeite Objekt
pt_pt: Editar objeto

source: Delete class
de: Lösche Klasse
pt_pt: Remover classe

source: Delete interface
de: Lösche Interface
pt_pt: Remover interface

source: "%s" replace?
de: "%s" ersetzen?
pt_pt: "%s" substituir?

source: Still searching!
de: Die Suche läuft noch!
pt_pt: Ainda em procura!

source: %d occurrences in %d of total %d files
de: %d Fundstellen in %d von insgesamt %d Dateien
pt_pt: %d ocorrências em %d no total de %d arquivos

source: Position
pt_pt: Posição

source: Size
de: Größe
pt_pt: Tamanho

source: Control "%s" or some of its children can not be deleted because they are locked.
de: Komponente "%s" oder einige ihrer untergeordneten Elemente können nicht gelöscht werden, da sie gesperrt sind.
pt_pt: O controle "%s" ou alguns de seus filhos não podem ser excluídos porque estão bloqueados.

source: Some controls are locked. Can not delete controls.
de: Einige Steuerelemente sind gesperrt. Steuerelemente können nicht gelöscht werden.
pt_pt: Alguns controles estão bloqueados. Não é possível excluir controles.

source: Unknown object
de: Unbekanntes Objekt
pt_pt: Objeto desconhecido

source: Incompatible types: found %s but %s expected
de: Inkompatible Typen: gefunden %s aber %s erwartet
pt_pt: Tipos incompatíveis: encontrado %s mas %s esperado

source: No connection to:
de: Keine Verbindung zu:
pt_pt: Sem conexão com:

source: Cannot change property while server is active!
pt_pt: Não é possível alterar a propriedade enquanto o servidor estiver ativo!

source: Cannot change property when client is connected!
pt_pt: Não é possível alterar a propriedade quando o cliente está conectado!

source: Invalid pipe name specified!
pt_pt: Nome do pipe inválido especificado!

source: Copy %s to %s
de: Kopiere %s nach %s
pt_pt: Copiar %s para %s

source: "%s" can not be deleted
de: "%s" kann nicht gelöscht werden
pt_pt: "%s" não pode ser deletado

source: Error copying to "%s"
de: Fehler beim Kopieren nach "%s"
pt_pt: Erro ao copiar para "%s"

source: Generate configuration file:
de: Erzeuge Konfigurationsdatei:
pt_pt: Gerar arquivo de configuração:

source: The configuration file %s could not be created!
de: Die Konfigurationsdatei %s konnte nicht erstellt werden!
pt_pt: O arquivo de configuração %s não pôde ser criado!

source: Create directory:
de: Verzeichnis erstellen:
pt_pt: Criar diretório:

source: No admin rights. Continue?
de: Keine Administratorrechte. Fortsetzen?
pt_pt: Sem direitos de administrador. Continuar?

source: Please specify installation folder.
de: Bitte geben Sie den Installationsordner an.
pt_pt: Especifique a pasta de instalação.

source: Installation folder %s does not exist.
de: Installationsordner %s ist nicht vorhanden.
pt_pt: A pasta de instalação %s não existe.

source: Please specify folder for storing custom files.
de: Geben Sie den Ordner zum Speichern benutzerdefinierter Dateien an.
pt_pt: Especifique a pasta para armazenar arquivos personalizados.

source: Create desktop shortcut
de: Desktopverknüpfung erstellen
pt_pt: Criar atalho na área de trabalho

source: Create entry in the programs menu
de: Eintrag im Programmmenü anlegen
pt_pt: Criar entrada no menu de programas

source: Create additional desktop shortcut for Java-Editor in folder
de: Zusätzliche Desktop-Verknüpfung für Java-Editor im Ordner erstellen
pt_pt: Crie um atalho adicional na área de trabalho para o Java-Editor na pasta

source: save in it
de: darin speichern
pt_pt: salve isso

source: Save installation flow in
de: Installationsablauf speichern in
pt_pt: Salvar fluxo de instalação em

source: Ready
de: Fertig
pt_pt: Pronto

source: configuration file
de: Konfigurationsdatei
pt_pt: arquivo de configuração

source: desktop shortcut
de: Desktop-Verknüpfung
pt_pt: atalho da área de trabalho

source: Delete registry entries
de: Registryeinträge löschen
pt_pt: Excluir entradas do registro

source: Delete INI files
de: INI-Dateien löschen
pt_pt: Excluir arquivos INI

source: Invalid file format!
de: Ungültiges Dateiformat!
pt_pt: Formato inválido para arquivo!

source: Switch from a single algorithm structogram as the final solution to puzzle mode.
de: Wechseln Sie in den Puzzlemodus mit der fertigen Lösung aus einem einzigen Algorithmus-Struktogramm.
pt_pt: Alterne de um único structograma de algoritmo para a solução final do modo de quebra-cabeça.

source: Great, solved!
de: Prima, gelöst!
pt_pt: Ótimo, resolvido!

source: Try again!
de: Versuche es nochmal!
pt_pt: Tente novamente!

source: Easy
de: Leicht
pt_pt: Fácil

source: Medium
de: Mittel
pt_pt: Médio

source: Hard
de: Schwer
pt_pt: Difícil

source: VeryHard
de: SehrSchwer
pt_pt: MuitoDifícil

source: Copy block up
de: Kopiere Block nach oben
pt_pt: Copiar bloco acima

source: Copy block down
de: Kopiere Block nach unten
pt_pt: Copiar bloco abaixo

source: %d lines added
de: %d Zeilen hinzugefügt
pt_pt: %d linhas acrescentadas

source: %d lines modified
de: %d Zeilen geändert
pt_pt: %d linhas modificadas

source: %d lines deleted
de: %d Zeilen gelöscht
pt_pt: %d linhas removidas

source: No differences.
de: Keine Unterschiede.
pt_pt: Sem diferenças.

source: // TODO add your code here
de: // TODO hier Quelltext einfügen
pt_pt: // A FAZER (inserir código aqui)

source: Open file
de: Öffne Datei
pt_pt: Abrir arquivo

source: Unknown class
de: Unbekannte Klasse
pt_pt: Classe desconhecida

source: Name of object
de: Name für das Objekt
pt_pt: Nome para o objeto

source: Select attributes
de: Attributauswahl
pt_pt: Selecionar atributos

source: %s already exists
de: %s existiert schon
pt_pt: %s já existe

source: No documentation available
de: Keine Dokumentation vorhanden
pt_pt: Nenhuma documentação disponível

source: Compile "%s" with
de: Compiliere %s mit
pt_pt: Compilar %s com

source: <unknown>
de: <unbekannt>
pt_pt: Desconhecido

source: successfully compiled!
de: erfolgreich compiliert!
pt_pt: compilado com successo!

source: Transfer %s to the RCX
de: Übertrage %s an den RCX
pt_pt: Transferir %s para RCX

source: Successfully transfered!
de: Erfolgreich übertragen!
pt_pt: Transferido com sucesso!

source: Error during transfer to the RCX.
de: Fehler bei der Übertragung an den RCX.
pt_pt: Erro durante a transferência para RCX.

source: Cannot execute %s. Errorcode:
de: Kann %s nicht ausführen. Fehlercode:
pt_pt: Impossível executar %s. Código de erro:

source: Download abort
de: Download fehlgeschlagen
pt_pt: Abortar download

source: No internet connection
de: Keine Internetverbindung
pt_pt: Sem conexão com a Internet

source: Missing admin rights. Start the Java-Editor with the option "Run as administrator" from the context menu of it's desktop symbol.
de: Fehlende Administratorrechte. Starten Sie den Java-Editor mit der Option "Als Administrator ausführen" aus dem Kontextmenü seines Desktop-Symbols.
pt_pt: Direitos de administrador em falta. Inicie o Java-Editor com a opção "Executar como administrador" no menu de contexto do símbolo da área de trabalho.

source: not found.
de: nicht gefunden.
pt_pt: não encontrado.

source: Saved
de: Gespeichert
pt_pt: Salvo

source: Modified
de: Geändert am
pt_pt: Modificado

source: write protected
de: schreibgeschützt
pt_pt: protegido contra gravação

source: Over
de: Über
pt_pt: Sobrescrita

source: // start attributes
de: // Anfang Attribute
pt_pt: // atributos iniciais

source: // end attributes
de: // Ende Attribute
pt_pt: // atributos finais

source: // start components
de: // Anfang Komponenten
pt_pt: // componentes iniciais

source: // end components
de: // Ende Komponenten
pt_pt: // componentes finais

source: // start methods
de: // Anfang Methoden
pt_pt: // métodos iniciais

source: // end methods
de: // Ende Methoden
pt_pt: // métodos finais

source: Export to
de: Exportieren nach
pt_pt: Exportar para

source: Searchtext "%s" not found.
de: Suchtext %s nicht gefunden.
pt_pt: Nada encontrado ao procurar por "%s".

source: Run application
de: Starte Applikation
pt_pt: Executar aplicação

source: Corresponding Java file "%s" not found!
de: Zugehörige Java-Datei "%s" nicht gefunden!
pt_pt: Arquivo Java correspondente "%s" não encontrado!

source: Unable to debug Mindstorms programs.
de: Mindstorms-Programme können nicht mit dem Debugger untersucht werden.
pt_pt: Impossível depurar programas Mindstorms.

source: Reset program
de: Programm zurücksetzen
pt_pt: Reiniciar programa

source: successfully terminated.
de: erfolgreich beendet.
pt_pt: terminado com sucesso.

source: Length of array.
de: Die Länge der Reihung.
pt_pt: Comprimento do arranjo.

source: Class %s not found!
de: Klasse %s nicht gefunden!
pt_pt: Classe %s não encontrada!

source: No default printer selected in Windows.
de: In Windows ist kein Standarddrucker ausgewählt.
pt_pt: Nenhuma impressora padrão selecionada no Windows.

source: Open a subclass of
de: Öffne Unterklasse von
pt_pt: Abrir subclasse

source: Internet access locked!
de: Internetzugang gesperrt!
pt_pt: Acesso à Internet bloqueado!

source: Compile for mindstorms/Compile
de: Compilieren für Mindstorms/Compilieren
pt_pt: Compilar para Mindstorms/Compilar

source: Transfer to Android
de: Übertragen an Android
pt_pt: Transferir para Android

source: Download Lejos firmware
pt_pt: Baixar Lejos-Firmware

source: File "%s" not found.
de: Datei "%s" nicht gefunden.
pt_pt: Arquivo "%s" não encontrado.

source: No current file "RunJava.Bat" found.
de: Keine aktuelle Datei "RunJava.Bat" gefunden.
pt_pt: Nenhum arquivo "RunJava.Bat" atual encontrado.

source: Identifier
de: Bezeichner
pt_pt: Identificador

source: Reserved word
de: Reserviertes Wort
pt_pt: Palavra reservada

source: Tag
pt_pt: Etiqueta

source: Symbol
pt_pt: Símbolo

source: Invalid symbol
de: Ungültiges Symbol
pt_pt: Símbolo inválido

source: Number
de: Zahl
pt_pt: Número

source: Escape character
de: Escapezeichen
pt_pt: Caractere de escape

source: Unknown word
de: Unbekanntes Wort
pt_pt: Palavra desconhecida

source: In the name of a GUI component, only a-z, A-Z, 0-9, and _ may occur. He must not start with a number.
de: Im Namen einer GUI-Komponenten dürfen nur a-z, A-Z, 0-9 und _ vorkommen. Er darf nicht mit einer Ziffer beginnen.
pt_pt: Em nome de um componente GUI, apenas a-z, A-Z, 0-9 e _ podem ocorrer. Ele não deve começar com um número.

source: The name of a GUI component can not be a data type.
de: Der Name einer GUI-Komponente darf kein Datentyp sein.
pt_pt: O nome de um componente GUI não pode ser um tipo de dados.

source: Another component already has the name:
de: Eine andere Komponente hat schon den Namen:
pt_pt: Outro componente já tem o nome:

source: %s already open!
de: %s schon geöffnet!
pt_pt: %s já está aberto!

source: doesn't exist!
de: existiert nicht!
pt_pt: não existe!

source: Can not create file %s! Error: %s
de: Kann Datei %s nicht erzeugen! Fehler: %s
pt_pt: Impossível criar arquivo %s! Erro: %s

source: Can not create directory %s!
de: Kann Ordner %s nicht erstellen!
pt_pt: Impossível criar diretório %s!

source: Project
de: Projekt
pt_pt: Projeto

source: %s already exists. Overwrite?
de: %s existiert schon. Überschreiben?
pt_pt: %s já existe. Sobrescrever?

source: (None)
de: (Kein)
pt_pt: (Nenhum)

source: Warning
de: Warnung
pt_pt: Aviso

source: Error
de: Fehler
pt_pt: Erro

source: Confirm
de: Bestätigen
pt_pt: Confirmar

source: &Yes
de: &Ja
pt_pt: Sim

source: &No
de: &Nein
pt_pt: Não

source: &Abort
de: &Abbruch
pt_pt: &Abortar

source: &Retry
de: &Wiederholen
pt_pt: Tentar novamente

source: &Ignore
de: &Ignorieren
pt_pt: &Ignorar

source: &All
de: &Alle
pt_pt: Todos

source: N&o to All
de: &Nein zu allen
pt_pt: Nã&o para todos

source: Yes to &All
de: &Ja zu allen
pt_pt: Sim para &todos

source: True
de: Wahr
pt_pt: Todos

source: False
de: Falsch
pt_pt: Falso

source: Dump
de: Ausgeben

source: Default
de: Standard

source: Classes
de: Klassen

source: doesn't show font Dialog
de: zeigt die Schriftart Dialog nicht an

source: Font zoom steps
de: Schrift Zoomschritte

source: Java book
de: Javabuch

source: Macro
de: Makro

source: Use {abstract}
de: {abstract} verwenden

source: Menus
de: Menüs

source: Breakpoint on/off
de: Haltepunkt ein/aus

source: Favorit add
de: Favorit hinzufügen

source: Favort delete
de: Favorit löschen

source: Tree view
de: Baumansicht

source: Move up
de: Hoch nach

source: Font zoom out
de: Schrift verkleinern

source: Font zoom in
de: Schrift vergrößern

source: Recognize assoziations
de: Erkenne Assoziationen

source: Same width
de: Gleiche Breite

source: Open URL
de: URL öffnen

source: Package
de: Paket

source: Recognize associations
de: Erkenne Assoziationen

source: Please wait!
de: Bitte warten!

source: Insert Overwrite
de: Einfügen/Überschreiben

source: Added
de: Hinzugefügt

source: Deleted
de: Gelöscht

source: Differences
de: Unterschiede

source: Ctrl+
de: Strg+

source: Shift+
de: Umsch+

source: BkSp
de: Rück

source: Enter
de: Eingabe

source: End
de: Ende

source: Home
de: Pos1

source: Del
de: Entf
